// This file is part of the Essence operating system.
// It is released under the terms of the MIT license -- see LICENSE.md.
// Written by: nakst.

// TODO Kernel driver:
// 		Extent allocation algorithm.
// TODO Design:
// 		Meta/flex block groups.
// 		Journal.
// 		Inline b-tree.
// 		Further data indirection. 
// 		Hash collisions. (Probably just remove index and enumerate directory contents instead?)

#ifndef KERNEL

#ifndef _DEFAULT_SOURCE
#define _DEFAULT_SOURCE
#endif

#ifndef _GNU_SOURCE
#define _GNU_SOURCE
#endif

#ifndef _BSD_SOURCE
#define _BSD_SOURCE
#endif

#ifndef OS_ESSENCE
typedef struct EsUniqueIdentifier {
	uint8_t d[16];
} EsUniqueIdentifier;
#endif

#endif

#define ESFS_BOOT_SUPER_BLOCK_SIZE 			(8192)			// The bootloader and superblock take up 16KB.
#define ESFS_DRIVE_MINIMUM_SIZE 			(1048576)		// The minimum drive size that can be formatted.
#define ESFS_DRIVER_VERSION 				(10)			// The current driver version.
#define ESFS_MAXIMUM_VOLUME_NAME_LENGTH 		(32)			// The volume name limit.

#define ESFS_CORE_NODE_KERNEL				(0)			// The kernel core node.
#define ESFS_CORE_NODE_ROOT				(1)			// The root directory core node.
#define ESFS_CORE_NODE_COUNT				(2)			// The number of core nodes.

#define ESFS_SIGNATURE_STRING        			("!EssenceFS2-----")	// The signature in the superblock.
#define ESFS_DIRECTORY_ENTRY_SIGNATURE 			("DirEntry")		// The signature in directory entries.
#define ESFS_GROUP_DESCRIPTOR_SIGNATURE			("GDTE")		// The signature in a group descriptor.
#define ESFS_INDEX_VERTEX_SIGNATURE			("INXE")		// The signature in a index vertex.

#define ESFS_NODE_TYPE_FILE 				(1)			// DirectoryEntry.nodeType: a file.
#define ESFS_NODE_TYPE_DIRECTORY 			(2)			// DirectoryEntry.nodeType: a directory.

#define ESFS_ATTRIBUTE_DATA				(1)			// Contains the data of the file, or a list of DirectoryEntries.
#define ESFS_ATTRIBUTE_FILENAME				(2)			// The UTF-8 filename.
#define ESFS_ATTRIBUTE_DIRECTORY			(3)			// Additional information about the directory.

#define ESFS_INDIRECTION_DIRECT				(1)			// The data is stored in the attribute.
#define ESFS_INDIRECTION_L1				(2)			// The attribute contains a extent list that points to the data.

#define ESFS_INDEX_MAX_DEPTH				(16)			// The maximum depth of the index tree. I'd be surprised if this gets past 8.
#define ESFS_VERTEX_KEY(vertex, key) 			((IndexKey *) ((uint8_t *) vertex + vertex->offset) + key)

typedef struct Attribute {
	/*  0 */ uint16_t type;						// Attribute type.
	/*  2 */ uint16_t size;						// The size in bytes. Must be 8 byte aligned.
} Attribute;

typedef struct AttributeFilename {
	/*  0 */ uint16_t type;						// ESFS_ATTRIBUTE_FILENAME.
	/*  2 */ uint16_t size;						// The size in bytes. Must be 8 byte aligned.
	/*  4 */ uint16_t length;					// The length of the filename in bytes.
	/*  6 */ uint16_t _unused;					// Unused.

#define ESFS_FILENAME_HEADER_SIZE (8)						// The size of the header of a AttributeFilename.
	/*  8 */ uint8_t filename[1];					// The UTF-8 filename.
} AttributeFilename;

typedef struct AttributeDirectory {
	/*  0 */ uint16_t type;						// ESFS_ATTRIBUTE_DIRECTORY.
	/*  2 */ uint16_t size;						// The size in bytes. Must be 8 byte aligned.
	/*  4 */ uint8_t _unused0[4];
	/*  8 */ uint64_t childNodes;					// The number of child nodes in the directory.
	/* 16 */ uint64_t indexRootBlock;				// The block containing the root IndexVertex for the directory.
	/* 24 */ uint64_t totalSize;					// The sum of sizes of all the directory's children in bytes.
} AttributeDirectory;

typedef struct AttributeData {
	/*  0 */ uint16_t type;						// ESFS_ATTRIBUTE_DATA.
	/*  2 */ uint16_t size;						// The size in bytes. Must be 8 byte aligned.
	/*  4 */ uint8_t indirection;					// The indirection used to access the data.
	/*  5 */ uint8_t dataOffset;					// The offset into the attribute where the data or extent list can be found.
	/*  6 */ uint16_t count;					// The number of data bytes in the attribute, or extents in the list.
	/*  8 */ uint64_t _unused[3];					// Unused.
#define ESFS_DATA_OFFSET (32)
	/* 32 */ uint8_t data[1];					// The data or extent list.

	// Format of each extent in the extent list:
	//       uint8_t offsetSize : 3, countSize : 3, unused : 2;	// The size of the offset and count fields in bytes - 1.
	//       uint8_t offset[offsetSize + 1];			// The first block in the extent, expressed as a signed offset from the start 
	//       							       of the previous extent in the list, or from 0 for the first extent. Big endian.
	//       uint8_t count[countSize + 1];				// The number of blocks encompassed by the extent. Big endian.
} AttributeData;

typedef struct DirectoryEntry {
	/*  0 */ char signature[8];					// Must be ESFS_DIRECTORY_ENTRY_SIGNATURE.
	/*  8 */ EsUniqueIdentifier identifier;				// Identifier of the node.
	/* 24 */ uint32_t checksum;					// CRC-32 checksum of DirectoryEntry.
	/* 28 */ uint16_t attributeOffset;				// Offset to the first attribute.
	/* 30 */ uint8_t nodeType;					// Node type.
	/* 31 */ uint8_t attributeCount;				// The number of attributes in the list.
	/* 32 */ uint64_t creationTime, accessTime, modificationTime;	// Timekeeping. In microseconds since 1st January 1970.
	/* 56 */ uint64_t fileSize;					// The amount of data referenced by the data attribute in bytes.
	/* 64 */ EsUniqueIdentifier parent;				// Identifier of the parent directory.
	/* 80 */ EsUniqueIdentifier contentType;                        // Identifier of the file content type.

#define ESFS_ATTRIBUTE_OFFSET (96)
	/* 96 */ uint8_t attributes[1024 - ESFS_ATTRIBUTE_OFFSET];	// Attribute list.
} DirectoryEntry;

typedef struct GroupDescriptor {
	/*  0 */ char signature[4];					// Must be ESFS_GROUP_DESCRIPTOR_SIGNATURE.
	/*  4 */ uint32_t blocksUsed;					// The number of used blocks in the group.
	/*  8 */ uint64_t blockBitmap;					// The bitmap indicating which blocks in the group are used.
	/* 16 */ uint32_t bitmapChecksum;				// CRC-32 checksum of the bitmap.
	/* 20 */ uint32_t checksum;					// CRC-32 checksum of this descriptor.
	/* 24 */ uint32_t largestExtent;				// The largest number of contiguous blocks.
	/* 28 */ uint32_t _unused[7];					// Unused.
} GroupDescriptor;

typedef struct DirectoryEntryReference {
	/*  0 */ uint64_t block;					// The block containing the directory entry.
	/*  8 */ uint32_t offsetIntoBlock;				// Offset into the block to find the directory entry.
	/* 12 */ uint32_t _unused;					// Unused.
} DirectoryEntryReference;

typedef struct IndexKey {
	/*  0 */ uint64_t value;					// The CRC-64 hashed node path. Ignored for the +1 vertex (assumed to be maximum possible).
	/*  8 */ uint64_t child;					// The block containing the child IndexVertex. Set to 0 for a leaf.
									// All keys in the child should be less than this key.
									// This is the only valid field in the +1 key.
	/* 16 */ DirectoryEntryReference data;				// The directory entry this key refers to.
} IndexKey;

typedef struct IndexVertex {
	/*  0 */ char signature[4];					// Must be ESFS_INDEX_VERTEX_SIGNATURE.
	/*  4 */ uint32_t checksum;					// CRC-32 checksum of IndexVertex.
	/*  8 */ uint16_t offset;					// Offset to the first IndexKey.
	/* 10 */ uint16_t count;					// The number of IndexKeys, (superblock.blockSize - this.offset) / sizeof(IndexKey).
	/* 12 */ uint16_t maxCount;					// The maximum number of IndexKeys that can fit in the vertex.
	/* 14 */ uint16_t _unused0;					// Unused.
	/* 16 */ uint64_t _unused1[2];					// Unused.

#define ESFS_INDEX_KEY_OFFSET (32)
	/* 32 */ IndexKey keys[1];					// There are this.count keys.
} IndexVertex;

typedef struct Superblock {
	/*   0 */ char signature[16];					// The filesystem signature; should be ESFS_SIGNATURE_STRING.
	/*  16 */ char volumeName[ESFS_MAXIMUM_VOLUME_NAME_LENGTH];	// The name of the volume.
	
	/*  48 */ uint16_t requiredReadVersion;				// If this is greater than the driver's version, then the filesystem cannot be read.
	/*  50 */ uint16_t requiredWriteVersion;			// If this is greater than the driver's version, then the filesystem cannot be written.
	
	/*  52 */ uint32_t checksum;					// CRC-32 checksum of Superblock.
	/*  56 */ uint8_t mounted;					// Non-zero to indicate that the volume is mounted, or was not properly unmounted.
	/*  57 */ uint8_t _unused2[7];
	
	/*  64 */ uint64_t blockSize;					// The size of a block on the volume.
	/*  72 */ uint64_t blockCount;					// The number of blocks on the volume.
	/*  80 */ uint64_t blocksUsed;					// The number of blocks that are in use.
	
	/*  88 */ uint32_t blocksPerGroup;				// The number of blocks in a group.
	/*  92 */ uint8_t _unused3[4];
	/*  96 */ uint64_t groupCount;					// The number of groups on the volume.
	/* 104 */ uint64_t blocksPerGroupBlockBitmap;			// The number of blocks used to a store a group's block bitmap.
	/* 112 */ uint64_t gdtFirstBlock;				// The first block in the group descriptor table.
	/* 120 */ uint64_t directoryEntriesPerBlock;			// The number of directory entries in a block.
	/* 128 */ uint64_t _unused0;					// Unused.
	
	/* 136 */ EsUniqueIdentifier identifier;			// The unique identifier for the volume.
	/* 152 */ EsUniqueIdentifier osInstallation;			// The unique identifier of the Essence installation this volume was made for. All zero for a non-installation volume.
	/* 168 */ EsUniqueIdentifier nextIdentifier;			// The identifier to give to the next created file.

	/* 184 */ DirectoryEntryReference kernel;			// The kernel. For convenient access by the bootloader.
	/* 200 */ DirectoryEntryReference root;				// The root directory.

	/* 216 */ uint8_t _unused1[8192 - 216];				// Unused.
} Superblock;

uint64_t EncodeExtent(uint64_t extentStart, uint64_t previousExtentStart, uint64_t extentCount, uint8_t *encode) {
	int64_t relativeStart = (int64_t) (extentStart - previousExtentStart);
	uint64_t absoluteRelativeStart = (uint64_t) (relativeStart < 0 ? -relativeStart : relativeStart);

	uint8_t startBytes = 
		absoluteRelativeStart < 0x80 			? 1
		: absoluteRelativeStart < 0x8000 		? 2
		: absoluteRelativeStart < 0x800000		? 3
		: absoluteRelativeStart < 0x80000000		? 4
		: absoluteRelativeStart < 0x8000000000		? 5
		: absoluteRelativeStart < 0x800000000000	? 6
		: absoluteRelativeStart < 0x80000000000000	? 7
		: 8;
	uint8_t countBytes = 
		extentCount < 0x80 			? 1
		: extentCount < 0x8000 			? 2
		: extentCount < 0x800000		? 3
		: extentCount < 0x80000000		? 4
		: extentCount < 0x8000000000		? 5
		: extentCount < 0x800000000000		? 6
		: extentCount < 0x80000000000000	? 7
		: 8;

	uint64_t position = 0;
